Revit 2027 API
ParameterTypeId.CutLineType Property
 "Cut Line Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CutLineType { get; }
Public Shared ReadOnly Property CutLineType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CutLineType {
	ForgeTypeId^ get ();
}
static member CutLineType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace